
i1 : --- allSections.m2
     -------------   Section 1   ---------------
     3!  -- dummy line to get the numbnering right loadPackage("RealRoots");

o1 = 6

i2 : variations({2,-3,0,-8,12,0,0,8,-12,0})

o2 = 3

i3 : R = QQ[x];

i4 : f = x*(2*x-3)*(x^4-2)^2

       10     9     6      5     2
o4 = 2x   - 3x  - 8x  + 12x  + 8x  - 12x

o4 : R

i5 : BudanFourierBound(f, 0, infinity)

o5 = 3

i6 : BudanFourierBound(f, -2, 1)

o6 = 7

i7 : SylvesterCount(f, x^2-1, -2, 3)

o7 = 2

i8 : SturmCount(f)

o8 = 4

i9 : realRootIsolation(f,1/5)

         165    75       15       75  165    45  195
o9 = {{- ---, - --}, {- ---, 0}, {--, ---}, {--, ---}}
         128    64      128       64  128    32  128

o9 : List

i10 : SturmCount(f, -1, 2, Multiplicity=>true)

o10 = 4

i11 : HurwitzMatrix(x^4 + 5*x^3 + 7*x^2 + 11*x + 13) 

o11 = | 5 11 0  0  |
      | 1 7  13 0  |
      | 0 5  11 0  |
      | 0 1  7  13 |

               4        4
o11 : Matrix QQ  <--- QQ

i12 : isHurwitzStable(x^4 + 5*x^3 + 7*x^2 + 11*x + 13) 

o12 = false

i13 : isHurwitzStable(x^4 + 9*x^3 + 7*x^2 + 5*x + 3)

o13 = true

i14 : -------------   Section 2   ---------------
      S=QQ[x,y]

o14 = S

o14 : PolynomialRing

i15 : I = ideal(x^2*y^2-3*x^2-3*y^2+5, -3*x^2*y+2*x*y+4*x*y^2+1)

              2 2     2     2          2        2
o15 = ideal (x y  - 3x  - 3y  + 5, - 3x y + 4x*y  + 2x*y + 1)

o15 : Ideal of S

i16 : f = x+y 

o16 = x + y

o16 : S

i17 : regularRepresentation(f,I)

o17 = (| 1 x x2 xy xy2 y y2 y3 |, | 0 0 -1/3  1/3 -35/4 0 0 -105/16 |)
                                  | 1 0 5/3   0   0     0 0 1/4     |
                                  | 0 1 2/3   0   21/4  0 0 63/16   |
                                  | 0 1 5/3   2/3 0     1 0 -5/4    |
                                  | 0 0 19/9  7/3 -1/2  0 1 -23/24  |
                                  | 1 0 -20/9 0   -1/4  0 0 19/48   |
                                  | 0 0 2/3   0   21/4  1 0 269/48  |
                                  | 0 0 4/3   0   0     0 1 -1/2    |

o17 : Sequence

i18 : g = univariateEliminant(f,I)

o18 =      8       7         6        5          4         3          2
      1296Z  - 432Z  - 38223Z  - 4806Z  + 209784Z  + 14172Z  - 430242Z ...

o18 : QQ[Z]

i19 : T = ring(g)

o19 = T

o19 : PolynomialRing

i20 : gens gb ideal(g,diff(Z,g))

o20 = | 1 |

              1       1
o20 : Matrix T  <--- T

i21 : SturmCount(g)

o21 = 4

i22 : (f,ch,ph) = rationalUnivariateRepresentation(I);
8

i23 : f

o23 = x + y

o23 : S

i24 : ch

       8   1 7   4247 6   89 5   8741 4   1181 3   71707 2   2051    6044
o24 = Z  - -Z  - ----Z  - --Z  + ----Z  + ----Z  - -----Z  - ----Z + ----
           3      144     24      54       108      216       324     27

o24 : QQ[Z]

i25 : ph

o25 =      7         6        5          4         3          2        ...
       864Z  + 21348Z  - 6066Z  - 231771Z  - 17610Z  + 701286Z  + 6986 ...
      {--------------------------------------------------------------- ...
            7        6          5         4          3         2       ...
       5184Z  - 1512Z  - 114669Z  - 12015Z  + 419568Z  + 21258Z  - 430 ...

o25 : List

i26 : -------------   Section 3   ---------------
      rank traceForm(1_S,I)

o26 = 8

i27 : signature traceForm(1_S,I)

o27 = 4

i28 : signature traceForm(y^2+2*y,I)

o28 = 4

i29 : 
