
i1 : --restart
     truncateOutput 70

i2 : loadPackage("RealRoots");

i3 : variations({2,-3,0,-8,12,0,0,8,-12,0})

o3 = 3

i4 : R = QQ[x];

i5 : f = x*(2*x-3)*(x^4-2)^2

       10     9     6      5     2
o5 = 2x   - 3x  - 8x  + 12x  + 8x  - 12x

o5 : R

i6 : BudanFourierBound(f, 0, infinity)

o6 = 3

i7 : BudanFourierBound(f, -2, 1)

o7 = 7

i8 : SylvesterCount(f, x^2-1, -2, 3)

o8 = 2

i9 : SturmCount(f)

o9 = 4

i10 : realRootIsolation(f,1/5)

          165    75       15       75  165    45  195
o10 = {{- ---, - --}, {- ---, 0}, {--, ---}, {--, ---}}
          128    64      128       64  128    32  128

o10 : List

i11 : SturmCount(f, -1, 2, Multiplicity=>true)

o11 = 4

i12 : HurwitzMatrix( x^4 + 5*x^3 + 7*x^2 + 11*x + 13 ) 

o12 = | 5 11 0  0  |
      | 1 7  13 0  |
      | 0 5  11 0  |
      | 0 1  7  13 |

               4        4
o12 : Matrix QQ  <--- QQ

i13 : isHurwitzStable( x^4 + 5*x^3 + 7*x^2 + 11*x + 13 ) 

o13 = false

i14 : isHurwitzStable( x^4 + 9*x^3 + 7*x^2 + 5*x + 3 )

o14 = true

i15 : -------------   end Section 1   ---------------
      S=QQ[x,y]

o15 = S

o15 : PolynomialRing

i16 : I = ideal(5-3*x^2-3*y^2+x^2*y^2,  1 + 2*x*y - 4*x*y^2 + 3*x^2*y)

              2 2     2     2        2        2
o16 = ideal (x y  - 3x  - 3y  + 5, 3x y - 4x*y  + 2x*y + 1)

o16 : Ideal of S

i17 : f = x+y 

o17 = x + y

o17 : S

i18 : regularRepresentation(f,I)

o18 = (| 1 x x2 xy xy2 y y2 y3 |, | 0 0 1/3   -1/3 -35/4 0 0 -105/16 |)
                                  | 1 0 5/3   0    0     0 0 -1/4    |
                                  | 0 1 -2/3  0    21/4  0 0 63/16   |
                                  | 0 1 -5/3  -2/3 0     1 0 -5/4    |
                                  | 0 0 19/9  7/3  1/2   0 1 23/24   |
                                  | 1 0 -20/9 0    1/4   0 0 -19/48  |
                                  | 0 0 -2/3  0    21/4  1 0 269/48  |
                                  | 0 0 4/3   0    0     0 1 1/2     |

o18 : Sequence

i19 : g = univariateEliminant(f,I)

o19 =                          8                            7            ...
      365592192996034261684224Z  + 121864064332011420561408Z  - 10782430 ...

o19 : QQ[Z]

i20 : T=ring(g)

o20 = T

o20 : PolynomialRing

i21 : gens gb ideal(g,diff(Z,g))

o21 = | 1 |

              1       1
o21 : Matrix T  <--- T

i22 : SturmCount(g)

o22 = 4

i23 : rationalUnivariateRepresentation(I)
8

o23 =                                                                    ...
               8   1 7   4247 6   89 5   8741 4   1181 3   71707 2   205 ...
      (x + y, Z  + -Z  - ----Z  + --Z  + ----Z  - ----Z  - -----Z  + --- ...
                   3      144     24      54       108      216       32 ...
                                                                         ...

o23 : Sequence

i24 : 
      --Maybe:
      -- (h,k,l)=rationalUnivariateRepresentation(I);
      --
      --  The show h,k,l, all on one line wach?
      
